<a href="https://colab.research.google.com/github/lethikieuly/PANDAS-FUNCTION/blob/main/pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**STRUCTURE**

class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)
Two-dimensional, size-mutable, potentially heterogeneous tabular data.
 #hai chiều, change size và không đồng nhất

In [26]:
import pandas as pd
import numpy as np

1/ Create a dataframe

In [21]:
a= {'Name':['BuiLy', 'Linda', 'Dange'],'sex':[2,5,4]}
df=pd.DataFrame(data=a)
df

    Name  sex
0  BuiLy    2
1  Linda    5
2  Dange    4

In [22]:
df.dtypes

Name    object
sex      int64
dtype: object

In [28]:
df=pd.DataFrame(data=a,dtype=np.int8)
df.dtypes

Name    object
sex       int8
dtype: object

In [30]:
  df1=pd.DataFrame(np.array([[1,2], [2,0], [0,1]]),
                  columns=['a','b'])
  df

    Name  sex
0  BuiLy    2
1  Linda    5
2  Dange    4